
&Вместо("ВыполнитьКонтрольРезультатовПроведения")
Процедура сиОтклКонтрОст_ВыполнитьКонтрольРезультатовПроведения(Механизмы, Документ, МенеджерВременныхТаблиц, Отказ)
	
	Если ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ПродолжитьВызов(Механизмы, Документ, МенеджерВременныхТаблиц, Отказ);
КонецПроцедуры

&Вместо("УчетныеМеханизмыДокумента")
Функция сиОтклКонтрОст_УчетныеМеханизмыДокумента(Документ)
	
	Если ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций Тогда
		МеханизмыДокумента = Новый Массив;
		Результат = МеханизмыДокумента;
	Иначе 
		Результат = ПродолжитьВызов(Документ);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&После("ПровестиДокумент")
Процедура сиОтклКонтрОст_ПровестиДокумент(Документ, Отказ, ДопПараметры)
	Если ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций Тогда
		Отказ = Ложь;
	КонецЕсли;
КонецПроцедуры
